In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [11]:
df = pd.DataFrame({'numbers': [1, 2, 3], 'colors': ['red', 'white', 'blue'], 'animals' : ['cats','dogs','pigs'], 'drinks' : ['cola','pepsi','redbull']})

In [12]:
df # creating new pandas dataframe

   numbers colors animals   drinks
0        1    red    cats     cola
1        2  white    dogs    pepsi
2        3   blue    pigs  redbull

In [13]:
df.columns

Index(['numbers', 'colors', 'animals', 'drinks'], dtype='object')

In [14]:
df['animals']

0    cats
1    dogs
2    pigs
Name: animals, dtype: object

In [16]:
DataFrame(df, columns = ['numbers','colors','dates']) # new df with additional NaN coulmn

   numbers colors  dates
0        1    red    NaN
1        2  white    NaN
2        3   blue    NaN

In [18]:
df.tail(2) # default 5 rows will be returned else head,tail can be used to retrieve rows

   numbers colors animals   drinks
1        2  white    dogs    pepsi
2        3   blue    pigs  redbull

In [21]:
df.loc[0]

numbers       1
colors      red
animals    cats
drinks     cola
Name: 0, dtype: object

In [22]:
df['food'] ='burger'

In [23]:
df

   numbers colors animals   drinks    food
0        1    red    cats     cola  burger
1        2  white    dogs    pepsi  burger
2        3   blue    pigs  redbull  burger

In [24]:
food = Series(['Chips','Cookies'], index = [0,2])

In [27]:
df['food'] = food
df #adding new column with array created above

   numbers colors animals   drinks     food
0        1    red    cats     cola    Chips
1        2  white    dogs    pepsi      NaN
2        3   blue    pigs  redbull  Cookies

In [28]:
data = {"students" : ['raj','meera','pooja'],"ranks":[1,2,3]}
DataFrame(data) # creating dataframes from dictionaries

  students  ranks
0      raj      1
1    meera      2
2    pooja      3